Documents/Ведомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Ведомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВедомостьДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.СимволыВедомости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Литеры</Name>
					<Comment>Строковые символы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыСтрокой</Name>
					<Comment>Перечень ГУИД ссылок справочника договоры (разделитель";")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыТаблицей</Name>
					<Comment>Таблица значений с колонкой из ссылок справочника  договоры</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь создавший документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Ведомость/Forms/ФормаГрупповвогоИзмененияДоговоров/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитыФормы();
	ДобавитьЭлементыФормы();
	
	ЭтотОбъект.Активен = Истина;
	
	ЗаполнитьТабличнуюЧастьФормы(СсылкиДоговоров(Параметры.ДанныеДляИзменения));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
		//ЭтотОбъект.ОкончаниеДействия = КонецНедели(ТекущаяДата());
КонецПроцедуры
	
&НаКлиенте
Процедура ОчиститьДатыДействияДоговора(Элемент)

	Если ЭтотОбъект.ОчиститьДату Тогда
		ЭтотОбъект.НачалоДействия = '00010101';
		ЭтотОбъект.ОкончаниеДействия = '00010101';
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОбновитьАктивныеДоговоры(Команда)
	
	ОчиститьСообщения();
	
	ОбновитьАктивныеДоговорыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнение табличной части формы после обновления активных договоров.
// Информирование пользователя об успешном обновлении.
//
// Параметры:
//  Ссылки  - Массив - Ссылки на договора в табличной части формы.
//
&НаСервере
Процедура ЗаполнитьТабличнуюЧастьФормы(Ссылки)
	
	АктивныеДоговоры = 0;
	ВсеДоговоры = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.Активен КАК Активен,
	|	Договоры.НачалоДействия КАК НачалоДействия,
	|	Договоры.ОкончаниеДействия КАК ОкончаниеДействия
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В(&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		АктивныеДоговоры = ?(Выборка.Активен, АктивныеДоговоры + 1,  АктивныеДоговоры + 0);
		ВсеДоговоры = ВсеДоговоры + 1;
		
		СтрТабЧасти = ЭтотОбъект.ДоговорыДляИзменения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТабЧасти, Выборка); 
		
	КонецЦикла;
	
	ЭтотОбъект.ДоговорыДляИзменения.Сортировать("Активен Убыв");
	
	Элементы.ИнформацияОДоговорах.Заголовок = СтрШаблон(
	НСтр("ru ='Всего выделено договоров - %1, из них активные - %2.'"), ВсеДоговоры, АктивныеДоговоры);
	
КонецПроцедуры

// Добавление реквизитов формы.
//
&НаСервере
Процедура ДобавитьРеквизитыФормы()
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("НачалоДействия",
		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)))
	);
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ОкончаниеДействия", 
		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)))
	);
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Активен",
		Новый ОписаниеТипов("Булево"))
	);
	
		ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ОчиститьДату",
		Новый ОписаниеТипов("Булево"))
	);
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ДоговорыДляИзменения",
		Новый ОписаниеТипов("ТаблицаЗначений"), , "ДоговорыДляИзменения")
	);
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Договор",
		Новый ОписаниеТипов("СправочникСсылка.Договоры"), "ДоговорыДляИзменения", "Договор")
	);
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Активен",
		Новый ОписаниеТипов("Булево"), "ДоговорыДляИзменения", "Активен")
	);
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("НачалоДействия",
		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)), "ДоговорыДляИзменения", "НачалоДействия")
	);
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ОкончаниеДействия",
		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)), "ДоговорыДляИзменения", "ОкончаниеДействия")
	);
	
	КомандаИзменить = Команды.Добавить("ОбновитьАктивныеДоговоры");
	КомандаИзменить.Действие = "ОбновитьАктивныеДоговоры";
	КомандаИзменить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КомандаИзменить.Заголовок = "ОбновитьАктивные";
	
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

// Добавление элементов формы.
//
&НаСервере
Процедура ДобавитьЭлементыФормы() 
	
	ГрупДекорация = Элементы.Вставить("Декорация", Тип("ГруппаФормы"),, ПодчиненныеЭлементы.Получить(0));
	ГрупДекорация.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГрупДекорация.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГрупДекорация.Высота = 3;
	ГрупДекорация.ГоризонтальноеПоложениеВГруппе  =ГоризонтальноеПоложениеЭлемента.Центр;
		
	ГрупВводаИзменений = Элементы.Вставить("РеквизитыДляГрупповогоИзменения", Тип("ГруппаФормы"),, ПодчиненныеЭлементы.Получить(1));
	ГрупВводаИзменений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГрупВводаИзменений.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГрупВводаИзменений.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГрупВводаИзменений.Заголовок = "Введите данные для группового изменения активных договоров.";
	
	ГрупКнопкаКоманды = Элементы.Вставить("Кнопка", Тип("ГруппаФормы"),, ПодчиненныеЭлементы.Получить(2));
	ГрупКнопкаКоманды.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГрупКнопкаКоманды.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ГрупТаблицаФормы = Элементы.Вставить("ТаблицаФормы", Тип("ГруппаФормы"),, ПодчиненныеЭлементы.Получить(3));
	ГрупТаблицаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГрупТаблицаФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГрупТаблицаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементДекорацииФормы = ЭтаФорма.Элементы.Добавить("ИнформацияОДоговорах", Тип("ДекорацияФормы"), ГрупДекорация);
	ЭлементДекорацииФормы.Заголовок = "";
	ЭлементДекорацииФормы.Шрифт = Новый Шрифт(, 11, Истина, , , );
	ЭлементДекорацииФормы.ЦветТекста = Новый Цвет(77, 77, 77);
	
	Картинка = БиблиотекаКартинок.Обновить;
	ЭлементКнопкаИзменить = Элементы.Добавить("Обновить", Тип("КнопкаФормы"), ГрупКнопкаКоманды);
	ЭлементКнопкаИзменить.Картинка = Картинка;
	ЭлементКнопкаИзменить.ИмяКоманды = "ОбновитьАктивныеДоговоры";
	
	ЭлементБулево = Элементы.Добавить("АктивенРеквизит", Тип("ПолеФормы"), ГрупВводаИзменений);
	ЭлементБулево.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементБулево.ВидФлажка = ВидФлажка.Авто;
	ЭлементБулево.Заголовок = "Активность"+Символы.ПС+
		"договора.";
	ЭлементБулево.ПутьКДанным = "Активен";
	ЭлементБулево.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЭлементБулево.Подсказка = "Флажок для группового изменения активности договоров.";
	
	ЭлементБулево = Элементы.Добавить("ОчиститьДату", Тип("ПолеФормы"), ГрупВводаИзменений);
	ЭлементБулево.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементБулево.ВидФлажка = ВидФлажка.Авто;
	ЭлементБулево.Заголовок = "Очистить даты";
	ЭлементБулево.ПутьКДанным = "ОчиститьДату";
	ЭлементБулево.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЭлементБулево.Подсказка = "Флажок активации возможности очистки дат начала и (или) окончания действия договора,"+Символы.ПС+
		"Пользоваться осторожно, в справочнике могут оказаться не валидные данные.";
	
	ЭлементПолеВвода = Элементы.Добавить("НачалоДействияРеквизит", Тип("ПолеФормы"), ГрупВводаИзменений);
	ЭлементПолеВвода.ПутьКДанным = "НачалоДействия";
	ЭлементПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПолеВвода.Заголовок = "Начало действия";
	ЭлементПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЭлементПолеВвода.Подсказка = "Для группового изменения дат начала действия договора."+Символы.ПС+
		"Пустое поле оставит даты без изменений,"+Символы.ПС+
		"для очистки воспользуйтесь чекбоксом 'Очистить дату'.";
	
	ЭлементПолеВвода = Элементы.Добавить("ОкончаниеДействияРеквизит", Тип("ПолеФормы"), ГрупВводаИзменений);
	ЭлементПолеВвода.ПутьКДанным = "ОкончаниеДействия";
	ЭлементПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПолеВвода.Заголовок = "Окончание действия";
	ЭлементПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЭлементПолеВвода.Подсказка = "Для группового изменения дат окончания действия договора."+Символы.ПС+
		"Пустое поле оставит даты без изменений,"+Символы.ПС+
		"для очистки воспользуйтесь чекбоксом 'Очистить дату'.";
	
	ТаблицаФормыДоговоры = Элементы.Добавить("ДоговорыДляИзменения", Тип("ТаблицаФормы"), ГрупТаблицаФормы);
	ТаблицаФормыДоговоры.ПутьКДанным = "ДоговорыДляИзменения";
	ТаблицаФормыДоговоры.КоманднаяПанель.Видимость = Ложь;
	
	ГрупКолонокТаблицы = Элементы.Добавить("ГруппаКолонокТаблицы", Тип("ГруппаФормы"), ТаблицаФормыДоговоры);
	ГрупКолонокТаблицы.Вид = ВидГруппыФормы.ГруппаКолонок;
	ГрупКолонокТаблицы.ОтображатьЗаголовок = Ложь;
	ГрупКолонокТаблицы.Группировка = ГруппировкаКолонок.Горизонтальная;
	
	// Колонки табличной части формы.
	КолонкаДоговоры = Элементы.Добавить("Договор", Тип("ПолеФормы"), ГрупКолонокТаблицы);
	КолонкаДоговоры.Вид = ВидПоляФормы.ПолеВвода;
	КолонкаДоговоры.ПутьКДанным = "ДоговорыДляИзменения.Договор";
	КолонкаДоговоры.Доступность = Ложь;
	
	КолонкаАктивность = Элементы.Добавить("Активен", Тип("ПолеФормы"), ГрупКолонокТаблицы);
	КолонкаАктивность.Вид = ВидПоляФормы.ПолеФлажка;
	КолонкаАктивность.ПутьКДанным = "ДоговорыДляИзменения.Активен";
	КолонкаАктивность.Доступность = Ложь;

	КолонкаДатаНачало = Элементы.Добавить("НачалоДействия", Тип("ПолеФормы"), ГрупКолонокТаблицы);
	КолонкаДатаНачало.Вид = ВидПоляФормы.ПолеВвода;
	КолонкаДатаНачало.ПутьКДанным = "ДоговорыДляИзменения.НачалоДействия";
	КолонкаДатаНачало.Заголовок = "НачалоДействия";
	КолонкаДатаНачало.Доступность = Ложь;
	
	КолонкаДатаОкончание = Элементы.Добавить("ОкончаниеДействия", Тип("ПолеФормы"), ГрупКолонокТаблицы);
	КолонкаДатаОкончание.ПутьКДанным = "ДоговорыДляИзменения.ОкончаниеДействия";
	КолонкаДатаОкончание.Заголовок = "ОкончаниеДействия";
	КолонкаДатаОкончание.Доступность = Ложь;
	
	ЭтаФорма.УстановитьДействие("ПриОткрытии", "ПриОткрытии");
	Элементы["ОчиститьДату"].УстановитьДействие("ПриИзменении", "ОчиститьДатыДействияДоговора");
	
КонецПроцедуры 

// Обновляет данные на активных договорах.
//
&НаСервере
Процедура ОбновитьАктивныеДоговорыНаСервере()
	
	ИзменениеУспешно = Новый Массив;
	ИзменениеОшибка = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.ДоговорыДляИзменения Цикл
		
		ДоговорОбъект = СтрокаТаблицы.Договор.ПолучитьОбъект();
		
		Если ДоговорОбъект <> Неопределено Тогда
			
			Если ЭтотОбъект.НачалоДействия = '00010101' Тогда
				
				ЗаполнитьЗначенияСвойств(ДоговорОбъект, ЭтотОбъект, , "НачалоДействия");
				
			ИначеЕсли ЭтотОбъект.ОкончаниеДействия = '00010101' Тогда 
				
				ЗаполнитьЗначенияСвойств(ДоговорОбъект, ЭтотОбъект, , "ОкончаниеДействия");
				
			Иначе
				
				ЗаполнитьЗначенияСвойств(ДоговорОбъект, ЭтотОбъект);

			КонецЕсли;
			
			Если ЭтотОбъект.ОчиститьДату Тогда
				
				ЗаполнитьЗначенияСвойств(ДоговорОбъект, ЭтотОбъект);
				
				ДоговорОбъект.ОбменДанными.Загрузка = Истина;
				
			КонецЕсли;
			
			Попытка
				
				ДоговорОбъект.Записать();
				
				ИзменениеУспешно.Добавить(ДоговорОбъект.Наименование);
				
			Исключение
				
				ИзменениеОшибка.Добавить(ДоговорОбъект.Наименование);
				
				ИнфоОбОшибке = ИнформацияОбОшибке();
				Информация = СтрШаблон(
					"В договоре %1 ошибка записи:  %2.",
					ДоговорОбъект.Наименование, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОбОшибке));
				
				ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация);
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Данные.Запись'"),
					УровеньЖурналаРегистрации.Ошибка, Справочники.Договоры, СтрокаТаблицы.Договор,
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОбОшибке));
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧислоИзмененных = ИзменениеУспешно.Количество();
	ЧислоНеИзмененных = ИзменениеОшибка.Количество();
	ИзмененныеДоговоры = ?(ИзменениеУспешно.Количество() > 0, СтрСоединить(ИзменениеУспешно, ", "), "отсутствуют");
	НеИзмененныеДоговоры = ?(ИзменениеОшибка.Количество() > 0, СтрСоединить(ИзменениеОшибка, ", "), "отсутствуют");
	Информация = СтрШаблон("Измененные договоры: (%1) %3 шт." + Символы.ПС +
		"Договоры при изменении которых возникла ошибка: (%2) %4 шт.", ИзмененныеДоговоры, НеИзмененныеДоговоры, ЧислоИзмененных, ЧислоНеИзмененных);
	
	ЗаполнитьТабличнуюЧастьФормы(СсылкиДоговоров(ЭтотОбъект.ДоговорыДляИзменения));
	
	ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация);
	
КонецПроцедуры

// Возвращает массив ссылок для запроса из данных коллекций значений с ссылками.
//
// Параметры:
//  Коллекция  - Произвольный - коллекции значений. 
//
// Возвращаемое значение:
//   Массив  - ссылки на элементы справочника.
&НаСервере
Функция СсылкиДоговоров(Коллекция)
	
	МассивСсылок = Новый Массив;
	
	Если ТипЗнч(Коллекция) = Тип("Соответствие") Тогда
		
		Для каждого Элемент Из Коллекция Цикл
			МассивСсылок.Добавить(Элемент.Ключ);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("ДанныеФормыКоллекция")  Тогда
		
		МассивСсылок = Коллекция.Выгрузить().ВыгрузитьКолонку("Договор");
		
		Коллекция.Очистить();
		
	КонецЕсли;
	
	Возврат МассивСсылок;
	
КонецФункции 

#КонецОбласти
